sample_responses/create_shell.xml

<s:Envelope xml:lang="en-US"
   xmlns:s="http://www.w3.org/2003/05/soap-envelope"
   xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
   xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
   <s:Header>
     <wsa:Action>
 http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse
     </wsa:Action>
       <wsa:MessageID>
         uuid:1BD7E077-34CD-46F9-8AC2-F7D004C3D858
       </wsa:MessageID><wsa:To>
         http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
       </wsa:To>
       <wsa:RelatesTo>uuid:AF6A2E07-BA33-496E-8AFA-E77D241A2F2F</wsa:RelatesTo>
   </s:Header>
   <s:Body>
         <wst:ResourceCreated
           xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
           xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
           xmlns:wst="http://schemas.xmlsoap.org/ws/2004/09/transfer"
  xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
           <wsa:Address>
             http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
           </wsa:Address>
           <wsa:ReferenceParameters>
             <wsman:ResourceURI>
               http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd
             </wsman:ResourceURI>
             <wsman:SelectorSet>
               <wsman:Selector Name="ShellId">
                 uuid:C443F44F-28E4-486F-A5A1-12745F90CF5A
               </wsman:Selector>
             </wsman:SelectorSet>
             </wsa:ReferenceParameters>
         </wst:ResourceCreated>
       </s:Body>
 </s:Envelope>